Reports/СписокОсновныхСредствДляКабинета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>СписокОсновныхСредствДляКабинета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеСредства</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВЭксплуатации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/СписокОсновныхСредствДляКабинета/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПечатьНаСервере()
	Отчет.Примечание = "";
	Для Каждого Элемент Из Список Цикл
		Если Элемент.Пометка = Истина Тогда
			Отчет.Примечание =  Элемент;
		КонецЕсли;  
		
	КонецЦикла;	
	
	Макет = Отчеты.СписокОсновныхСредствДляКабинета.ПолучитьМакет("СписокОсновныхСредствПоУсловию");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
		"ВЫБРАТЬ
		| 		ОсновныеСредстваСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		| 		АВТОНОМЕРЗАПИСИ() КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|		РегистрСведений.ОсновныеСредства.СрезПоследних(&Период, )  КАК ОсновныеСредстваСрезПоследних
		| ;
		|  ////////////////////////////////////////
		|   ВЫБРАТЬ
		|	Сумма(ВТ.НомерСтроки) КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредстваСрезПоследних.ОсновноеСредство) КАК Наименование,
		|	ОсновныеСредстваСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	""Шт."" КАК ЕденицаИзмерения,
		|	1 КАК Количество
		|ИЗ
		|	РегистрСведений.ОсновныеСредства.СрезПоследних(&Период, )  КАК ОсновныеСредстваСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|		ПО ОсновныеСредстваСрезПоследних.ОсновноеСредство = ВТ.ОсновноеСредство";
	
	Если ЗначениеЗаполнено(Отчет.ОтветственноеЛицо) И НЕ ЗначениеЗаполнено(Отчет.УКого) Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ
		|	ОсновныеСредстваСрезПоследних.Примечание В (&Примечание)
		|	И ОсновныеСредстваСрезПоследних.Организация = &Организация
		//|	И ОсновныеСредстваСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо
		|	И ОсновныеСредстваСрезПоследних.ВЭксплуатации = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|
		|	ОсновныеСредстваСрезПоследних.ИнвентарныйНомер,
		|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредстваСрезПоследних.ОсновноеСредство),
		|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредстваСрезПоследних.УКого)";
		Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	//	Запрос.УстановитьПараметр("ОтветственноеЛицо", Отчет.ОтветственноеЛицо);
		Запрос.УстановитьПараметр("Период", Отчет.Период);
		Запрос.УстановитьПараметр("Примечание", Список);
		//Запрос.УстановитьПараметр("УКого", Отчет.УКого);

	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.УКого) И Не ЗначениеЗаполнено(Отчет.ОтветственноеЛицо)Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ
		|	ОсновныеСредстваСрезПоследних.Примечание В (&Примечание)
		|	И ОсновныеСредстваСрезПоследних.УКого = &УКого
		|	И ОсновныеСредстваСрезПоследних.Организация = &Организация
		|	И ОсновныеСредстваСрезПоследних.ВЭксплуатации = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеСредстваСрезПоследних.ИнвентарныйНомер,
		|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредстваСрезПоследних.ОсновноеСредство),
		|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредстваСрезПоследних.УКого)";
		Запрос.УстановитьПараметр("Организация", Отчет.Организация);
		//Запрос.УстановитьПараметр("ОтветственноеЛицо", Отчет.ОтветственноеЛицо);
		Запрос.УстановитьПараметр("Период", Отчет.Период);
		Запрос.УстановитьПараметр("Примечание", Список);
		Запрос.УстановитьПараметр("УКого", Отчет.УКого);

	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.УКого) И  ЗначениеЗаполнено(Отчет.ОтветственноеЛицо)Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ
		|	ОсновныеСредстваСрезПоследних.Примечание В(&Примечание)
		|	И ОсновныеСредстваСрезПоследних.УКого = &УКого
		|	И ОсновныеСредстваСрезПоследних.Организация = &Организация
		//|	И ОсновныеСредстваСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо
		|	И ОсновныеСредстваСрезПоследних.ВЭксплуатации = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеСредстваСрезПоследних.ИнвентарныйНомер,
		|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредстваСрезПоследних.ОсновноеСредство),
		|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредстваСрезПоследних.УКого)";
		Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	//	Запрос.УстановитьПараметр("ОтветственноеЛицо", Отчет.ОтветственноеЛицо);
		Запрос.УстановитьПараметр("Период", Отчет.Период);
		Запрос.УстановитьПараметр("Примечание", Список);
		Запрос.УстановитьПараметр("УКого", Отчет.УКого);

	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отчет.УКого) И  НЕ ЗначениеЗаполнено(Отчет.ОтветственноеЛицо)Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ

		|	ОсновныеСредстваСрезПоследних.Примечание В(&Примечание)
		|	И ОсновныеСредстваСрезПоследних.Организация = &Организация
		|	И ОсновныеСредстваСрезПоследних.ВЭксплуатации = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеСредстваСрезПоследних.ИнвентарныйНомер,
		|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредстваСрезПоследних.ОсновноеСредство)";
		Запрос.УстановитьПараметр("Организация", Отчет.Организация);
		Запрос.УстановитьПараметр("Период", Отчет.Период);
		Запрос.УстановитьПараметр("Примечание", Список);
		
		
	КонецЕсли;	
	//Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	//Запрос.УстановитьПараметр("ОтветственноеЛицо", Отчет.ОтветственноеЛицо);
	//Запрос.УстановитьПараметр("Период", Отчет.Период);
	//Запрос.УстановитьПараметр("Примечание", Список);
	//Запрос.УстановитьПараметр("УКого", Отчет.УКого);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	
	ТабДок.Очистить();
	//ОбластьЗаголовок.Параметры.ЗаКемЗакреплено = Отчет.Примечание;
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьСтрока, Выборка.Уровень());
	КонецЦикла;
	ОбластьПодвал.Параметры.ОтветственноеЛицо = Отчет.ОтветственноеЛицо;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Защита=Ложь;
	

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ПечатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Период = КонецДня(ТекущаяДата());
	Элементы.ТабДок.Редактирование=Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеСредстваСрезПоследних.Примечание КАК Примечание
		|ИЗ
		|	РегистрСведений.ОсновныеСредства.СрезПоследних КАК ОсновныеСредстваСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеСредстваСрезПоследних.Примечание";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Список.Добавить(СтрЗаменить(Выборка.Примечание,Символы.НПП,""),Выборка.Примечание);
	КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Сообщить("Привет");
КонецПроцедуры
